Revit 2027 API
Alignment.EndStation Property
 Specifies the station at which the alignment's geometric definition ends, in Revit internal model units (standard Imperial feet).
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EndStation { get; }
Public ReadOnly Property EndStation As Double
	Get
public:
property double EndStation {
	double get ();
}
member EndStation : float with get
Property Value
Double
Remarks
 This station may be outside the displayed range (DisplayedStartStation, DisplayedEndStation).
See Also
Reference
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace